//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δείγμα προγράμματος προκειμένου να παρουσιαστεί πως δηλώνονται μεταβλητές συνάρτησης.
package main

import "fmt"

// Ο data είναι είναι ένας struct στον οποίο μπορεί κανείς να αναθέτει μεθόδους.
type data struct {
	name string
	age  int
}

// Η displayName παρέχει μια ευχάριστη εκτύπωση του ονόματος.
func (d data) displayName() {
	fmt.Println("My Name Is", d.name)
}

// Η setAge θέτει την ηλικία και παρουσιάζει την τιμή.
func (d *data) setAge(age int) {
	d.age = age
	fmt.Println(d.name, "Is Age", d.age)
}

func main() {

	// Δηλώστε μια μεταβλητή τύπου data.
	d := data{
		name: "Bill",
	}

	fmt.Println("Proper Calls to Methods:")

	// Πως καλούμε μεθόδους τύπου στην Go.
	d.displayName()
	d.setAge(45)

	fmt.Println("\nWhat the Compiler is Doing:")

	// Αυτό κάνει η Go στο παρασκήνιο.
	data.displayName(d)
	(*data).setAge(&d, 45)

	// =========================================================================

	fmt.Println("\nCall Value Receiver Methods with Variable:")

	// Δηλώστε μια μεταβλητή συνάρτησης για την μέθοδο τύπου που είναι δεσμευμένη στην μεταβλητή d.
	// Η μεταβλητή συνάρτησης θα αποκτήσει το δικό της αντίγραφο της d επειδή η μέθοδος
	// χρησιμοποιεί λήπτη μεθόδου τιμής.
	f1 := d.displayName

	// Καλέστε την μέθοδο μέσω της μεταβλητής.
	f1()

	// Αλλάξτε την τιμή της d.
	d.name = "Joan"

	// Καλέστε την μέθοδο μέσω της μεταβλητής. Δεν παρατηρούμε την αλλαγη.
	f1()

	// =========================================================================

	fmt.Println("\nCall Pointer Receiver Method with Variable:")

	// Δηλώστε μια μεταβλητή συνάρτησης για την μέθοδο τύπου που είναι δεσμευμένη στην μεταβλητή d.
	// Η μεταβλητή συνάρτησης θα αποκτήσει την διεύθυνση της d επειδή η μέθοδος
	// χρησιμοποιεί λήπτη μεθόδου δείκτη διεύθυνσης.
	f2 := d.setAge

	// Καλέστε την μέθοδο μέσω της μεταβλητής.
	f2(45)

	// Αλλάξτε την τιμή της d.
	d.name = "Sammy"

	// Καλέστε την μέθοδο μέσω της μεταβλητής. Παρατηρούμε την αλλαγη.
	f2(45)
}
