//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δηλώστε ένα struct που αντιπροσωπεύει έναν παίκτη baseball. Συμπεριλάβετε τα πεδία name,
// atBats and hits.
// Δηλώστε μια μέθοδο τύπου που υπολογίζει την μέση τιμή των χτυπημάτων ενός παίκτη. Ο τύπος
// είναι Hits / AtBats.
// Δηλώστε μια φέτα αυτού του τύπου και δώστε ως αρχική τιμή αρκετούς παίκτες. Πραγματοποιείστε
// διαδοχική επίσκεψη των στοιχείων της φέτας, παρουσιάζοντας στην συνέχεια το πεδίο name και την
// μέση τιμή χτυπημάτων του κάθε παίκτη.
package main

// Προσθέστε δηλώσεις εισαγωγής (imports).

// Δηλώστε έναν struct που αντιπορσωπεύει έναν παίκτη.
// Συμπεριλάβετε πεδία με το όνομα name, atBats and hits.

// Δηλώστε μια μέθοδο τύπου που υπολογίζει τον μέσο χτυπημάτων για τον παίκτη.
func ( /* λήπτης μεθόδου */ ) average() /* τύπος επιστροφής */ {
}

func main() {

	// Δημιουργείστε μια φέτα παικτών και γεμίστε κάθε παίκτη
	// με τιμές πεδίων.

	// Παρουσιάστε το μέσο όρο χτυπημάτων για κάθε παίκτη στην φέτα.
}
