//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δηλώστε έναν τύπο struct προκειμένου να διατηρήσετε πληροφορίες ενός χρήστη (name, email and age).
// Δημιουργήστε μια τιμή αυτού του τύπου, δώστε αρχικές τιμές και παρουσιάστε την τιμή κάθε πεδίου.
//
// Δηλώστε και δώστε αρχική τιμή σε ένα ανώνυμο τύπο struct με τα ίδια τρια πεδία. Παρουσιάστε την τιμή του.
package main

// Προσθέστε δηλώσεις εισαγωγής (imports).

// Προσθέστε τον τύπο user και παρέχετε σχόλιο.

func main() {

	// Δηλώστε μεταβλητή τύπου user και δώστε αρχική τιμή χρησιμοποιώντας μια ρητή κατασκευή struct.

	// Παρουσιάστε τις τιμές των πεδίων.

	// Δηλώστε μια μεταβλητή χρησιμοποιώντας μια ανώνυμη struct.

	// Παρουσιάστε τις τιμές των πεδίων.
}
