//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Υλοποιείστε έναν τύπο πίνακα κατακερματισμού γενικού προγραμματισμού.
package main

// Δηλώστε έναν τύπο γενικού προγραμματισμού με το όνομα
// keymap που χρησιμοποιεί ένα υποκείμενο τύπο πίνακα
// κατακερματισμού με κλειδιά τύπου συμβολοσειράς και
// τιμές κάποιου τύπου T.

// Υλοποιήστε μια μέθοδο τύπου με το όνομα set που αποδέχεται
// ένα κλειδί τύπου συμβολοσειράς και μια τιμή τύπου T.

// Υλοποιείστε μια μέθοδο τύπου με το όνομα get που αποδέχεται
// ένα κλειδί τύπου συμβολοσειράς και επιστρέφει μια τιμή τύπου
// T και true ή false αν το κλειδί βρεθεί.

func main() {
	// Δημιουργήστε μια τιμή τύπου keymap που αποθηκεύει ακέραιους.

	// Προσθέστε μια τιμή με το κλειδί "jack" και τιμή 10.

	// Προσθέστε μια τιμή με το κλειδί "jill" και τιμή 20.

	// Πάρτε την τιμή για το "jack" και επιβεβαιώστε ότι βρέθηκε.

	// Τυπώστε την τιμή για το κλειδί "jack".

	// Πάρτε την τιμή για το "jill" και επιβεβαιώστε ότι βρέθηκε.

	// Τυπώστε την τιμή για το κλειδί "jill".
}
