//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Υλοποιήστε μια γενική συνάρτηση με το όνομα marshal, που να μπορεί να
// σειριοποιήσει (στμ. marshal) JSON όμως δέχεται μόνο τιμές, που υλοποιούν
// την διεπαφή json.Marshaler interface.
package main

// Προσθέστε δηλώσεις εισαγωγής (import).

// Δηλώστε μια συνάρτηση γενικού προγραμματισμού με το όνομα marshal,
// που μπορεί να δεχτεί μόνο τιμές του τύπου T, που υλοποιεί την
// διεπαφή json.Marshaler.

// Ορίστε έναν τύπο με το όνομα user με δύο πεδία, το πεδίο name και
// το πεδίο email.

// Υλοποιήστε μια μέθοδο τύπου, που υλοποιεί με την σειρά της την διεπαφή
// json.Marshaler. Η μέθοδος τύπου πρέπει να επιστρέφει μια τιμή τύπου
// user ως JSON.

func main() {

	// Δημιουργείστε μια τιμή τύπου user.

	// Καλέστε την συνάρτηση γενικού προγραμματισμού marshal.

	// Παρουσιάστε την επιστραμμένη τιμή JSON.
}
