//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δηλώστε μια διεπαφή με το όνομα speaker με μια μέθοδο τύπου speak. Δηλώστε
// ένα struct με το όνομα english που αντιπροσωπεύει ένα πρόσωπο που μιλάει αγγλικά και
// δηλώστε ένα struct με το όνομα chinese, για κάποιον ο οποίος μιλάει κινέζικα. Υλοποιείστε
// την διεπαφή speaker για κάθε struct, χρησιμοποιώντας λήπτη μεθόδου τιμής και τις ακόλουθες
// ρητές συμβολοσειρές "Hello World" και "你好世界".
// Δηλώστε μια μεταβλητή τύπου speaker και εκχωρείστε την διεύθυνση μνήμης μιας τιμής τύπου
// english και καλέστε την μέθοδο τύπου. Κάντε το ίδιο, για μια τιμή τύπου chinese.
//
// Προσθέστε μια νέα συνάρτηση με το όνομα sayHello που αποδέχεται μια τιμή τύπου
// speaker. Υλοποιείστε αυτή την συνάρτηση ώστε, να καλέσει την μέθοδο speak στην τιμή διεπαφής.
// Στην συνέχεια, δημιουργείστε νέες τιμές για κάθε τύπο και χρησιμοποιείστε την συνάρτηση.
package main

// Προσθέστε δηλώσεις εισαγωγής (imports).

// Δηλώστε την διεπαφή speaker με μοναδική μέθοδο τύπου με το όνομα speak.

// Δηλώστε έναν άδειο τύπο struct με το όνομα english.

// Δηλώστε μια μέθοδο με το όνομα speak για τον τύπο english
// χρησιμοποιώντας έναν λήπτη μεθόδου τιμής. "Hello World"

// Δηλώστε έναν άδειο τύπο struct με το όνομα chinese.

// Δηλώστε μια μέθοδο με το όνομα speak για τον τύπο chinese
// χρησιμοποιώντας λήπτη μεθοδου δείκτη διεύθυνσης. "你好世界"

// Η sayHello αποδέχεται τιμές του τύπου speaker.
func sayHello( /* Δηλώστε την παράμετρο */ ) {

	// Καλέστε την μέθοδο τύπου speak από την παράμετρο speaker.
}

func main() {

	// Δηλώστε μια μεταβλητή του τύπου διεπαφής speaker
	// η οποία λαμβάνει την μηδενική τιμή της.

	// Δηλώστε μια μεταβλητή τύπου english.

	// Εκχωρείστε την τιμή english στην μεταβλητή speaker.

	// Καλέστε την μέθοδο speak από την μεταβλητή speaker.

	// Δηλώστε μια μεταβλητή του τύπου chinese.

	// Εκχωρείστε τον δείκτη διεύθυνσης chinese στην μεταβλητή speaker.

	// Καλέστε την μέθοδο τύπου speak από την μεταβλητή speaker.

	// Καλέστε την συνάρτηση sayHello με καινούργιες τιμές και δείκτες διεύθυνσης
	// των english και chinese.
}
