//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Υλοποιήστε έναν τύπο στοίβας γενικού προγραμματισμού.
package main

// Δηλώστε ένα τύπο γενικού προγραμματισμού με το όνομα stack που χρησιμοποιεί
// έναν struct με μοναδικό πεδίο με το όνομα data που δηλώνεται σαν μια φέτα τύπου T.

// Δηλώστε μια μέθοδο τύπου με το όνομα push που αποδέχεται μια τιμή κάποιου τύπου T
// και προσθέτει την τιμή στην φέτα.

// Δηλώστε μια μέθοδο με το όνομα pop που επιστρέφει την τελευταία τιμή κάποιου τύπου
// T που προστέθηκε στην φέτα και ένα σφάλμα.

// =============================================================================

func main() {

	// Δημιουργήστε μια τιμή τύπου στοίβας που αποθηκεύει ακέραιους.

	// Προσθέστε με την Push τις τιμές 10 και 20 στην στοίβα.

	// Αφαιρέστε με την Pop μια τιμή από την στοίβα.

	// Τυπώστε την τιμή που αφαιρέθηκε.

	// Αφαιρέστε άλλη τιμή από την στοίβα.

	// Τυπώστε την τιμή που αφαιρέθηκε.

	// Αφαιρέστε άλλη τιμή από την στοίβα. Κάτι τέτοιο θα πρέπει
	// να επιστρέψει ένα σφάλμα.
}
