//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δείγμα προγράμματος, προκειμένου να παρουσιαστεί ο τρόπος δήλωσης ενός
// περιορισμού τύπου, που δεν βασίζεται σε συμπεριφορά αλλά που βασίζεται
// στον τύπο των δεδομένων, ο οποίος είναι αποδεκτός. Αυτό το είδος περιορισμού
// είναι σημαντικό όταν συναρτήσεις (όπως η Add) πρέπει να πραγματοποιήσουν
// λειτουργίες (όπως η +) που δεν υποστηρίζονται από όλους τους τύπους.
package main

import "fmt"

type addOnly interface {
	string | int | int8 | int16 | int32 | int64 | float64
}

func Add[T addOnly](v1 T, v2 T) T {
	return v1 + v2
}

func main() {
	fmt.Println(Add(10, 20))
	fmt.Println(Add("A", "B"))
	fmt.Println(Add(3.14159, 2.96))
}
