//go:build OMIT || norun

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Υλοποιήστε μια συνάρτηση γενικού προγραμματισμού με το όνομα copyfy,
// οποία είναι περιορισμένη στο να κάνει μόνο αντίγραφα, από φέτες τύπου
// συμβολοσειράς ή ακεραίων.
package main

// Δηλώστε μια διεπαφή με το όνομα copyer, που δημιουργεί ένα περιορισμό
// σε συμβολοσειρές και ακεραίους.

// Υλοποιήστε μια συνάρτηση γενικού προγραμματισμού με το όνομα copyfy
// που αποδέχεται μια φέτα κάποιου τύπου T, όμως είναι περιορισμένη από την
// διεπαφή copyer.

func main() {

	// Δημιουργήστε μια φέτα συμβολοσειρών με τρεις τιμές.

	// Καλέστε την συνάρτηση copyfy, προκειμένου να κάνετε ένα αντίγραφο
	// της φέτας.

	// Παρουσιάστε την φέτα και το αντίγραφο.

	// Δημιουργήστε μια φέτα ακεραίων με τρΕις τιμές.

	// Καλέστε την συνάρτηση copyfy προκειμένου να κάνετε αντίγραφο της
	// φέτας.

	// Παρουσιάστε την φέτα και το αντίγραφο.
}
