//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δείγμα προγράμματος, προκειμένου να παρουσιαστεί η λειτουργία των ανώνυμων
// συναρτήσεων και των συναρτήσεων εγκολπώσεων (closures).
package main

import "fmt"

func main() {
	var n int

	// Δηλώστε μια ανώνυμη συνάρτηση και καλέστε την.
	func() {
		fmt.Println("Direct:", n)
	}()

	// Δηλώστε μια ανώνυμη συνάρτηση και εκχωρείστε την σε μια μεταβλητή.
	f := func() {
		fmt.Println("Variable:", n)
	}

	// Καλέστε την ανώνυμη συνάρτηση, μέσω της μεταβλητής.
	f()

	// Καθυστερήστε (defer) την κλήση στην ανώνυμη συνάρτηση, αφότου
	// επιστρέψει η συνάρτηση main.
	defer func() {
		fmt.Println("Defer 1:", n)
	}()

	// Εκχωρείστε την τιμή της n σε 3 πριν την επιστροφή.
	n = 3

	// Καλέστε την ανώνυμη συνάρτηση, μέσω της μεταβλητής.
	f()

	// Καθυστερήστε (defer) την κλήση στην ανώνυμη συνάρτηση, μέχρι μετά την
	// επιστροφή της main.
	defer func() {
		fmt.Println("Defer 2:", n)
	}()
}
