//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δηλώστε έναν τύπο struct που διατηρεί πληροφορίες για ένα χρήστη. Δηλώστε μια
// συνάρτηση που δημιουργεί μια τιμή και επιστρέφει δείκτες διεύθυνσης αυτού του τύπου και μια τιμή
// σφάλματος. Καλέστε αυτή την συνάρτηση από την main και παρουσιάστε την τιμή
//
// Κάντε μια δεύτερη κλήση στην συνάρτηση σας όμως αυτή τη φορά αγνοείστε την τιμή
// και απλά ελέγξτε την τιμή σφάλματος.
package main

// Προσθέστε δηλώσεις εισαγωγής (imports).

// Δηλώστε έναν τύπο με το όνομα user.

// Δηλώστε μια συνάρτηση που δημιουργεί τιμές τύπου user και επιστρέφει δείκτες διεύθυνσης
// σε αυτές τις τιμές και ένα σφάλμα με τιμή ίση με nil.
func funcName() /* (όρισμα επιστροφής δείκτη διεύθυνσης, όρισμα επιστροφής σφάλματος) */ {

	// Δημιουργείστε μια τιμή τύπου user και επιστρέψτε τις κατάλληλες τιμές.
}

func main() {

	// Χρησιμοποιείστε την συνάρτηση προκειμένου να δημιουργήσετε μια τιμή τύπου user. Ελέγξτε
	// το σφάλμα που επιστρέφεται.

	// ΠΑρουσιάστε την τιμή στην οποία ο δείκτης διέυθυνσης δείχνει.

	// Καλέστε την συνάρτηση ξανά και απλά ελέγξτε το σφάλμα.
}
