//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δηλώστε μια nil φέτα ακεραίων. Δημιουργείστε μια επανάληψη, που προσθέτει 10 τιμές
// στην φέτα. Επισκεφθείτε διαδοχικά τα στοιχεία της φέτας και παρουσιάστε κάθε τιμή.
//
// Δηλώστε μια φέτα πέντε συμβολοσειρών και δώστε αρχική τιμή στην φέτα με ρητές τιμές
// συμβολοσειρών. Παρουσιάστε όλα τα στοιχεία. Δημιουργείστε μια φέτα των δεικτών ένα
// και δύο και παρουσιάστε την θέση δείκτη και την τιμή κάθε στοιχείου στην νέα φέτα.
package main

// Προσθέστε δήλωση εισαγωγών (import).

func main() {

	// Δηλώστε μια nil φέτα ακεραίων.

	// Προσθέστε αριθμούς στην φέτα.

	// Παρουσιάστε κάθε τιμή στην φέτα.

	// Δηλώστε μια φέτα συμβολοσειρών και γεμίστε την φέτα με ονόματα.

	// Παρουσιάστε κάθε θέση δείκτη και τιμή φέτας.

	// Πάρτε μια φέτα των δεικτών 1 και 2 της φέτας των συμβολοσειρών.

	// Παρουσιάστε κάθε θέση δείκτη και τιμές φέτας για την νέα φέτα.
}
