//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δείγμα προγράμματος, προκειμένου να παρουσιαστεί πως μεγαλώνουν/αλλάζουν οι στοίβες
// εκτέλεσης.
package main

// Ο αριθμός των στοιχείων, κατά τον οποίο θα μεγεθυνθεί, κάθε πλαίσιο στοίβας.
// Εκτελέστε με τιμή 1 και μετά με τιμή 1024
const size = 1

// Η συνάρτηση main είναι το σημείο εισόδου για την εφαρμογή.
func main() {
	s := "HELLO"
	stackCopy(&s, 0, [size]int{})
}

// Η stackCopy εκτελείται αναδρομικά, μεγαλώνοντας με αυτό τον τρόπο, το μέγεθος
// της στοίβας.
//
//go:noinline
func stackCopy(s *string, c int, a [size]int) {
	println(c, s, *s)

	c++
	if c == 10 {
		return
	}

	stackCopy(s, c, a)
}
