//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δηλώστε έναν τύπο struct και δημιουργείστε μια τιμή αυτού του τύπου. Δημιουργήστε
// μια συνάρτηση που μπορεί να αλλάξει την τιμή κάποιου πεδίου, σε μεταβλητές αυτού
// του τύπου struct. Παρουσιάστε την τιμή, πριν και μετά, την κλήση της συνάρτησης σας.
package main

// Προσθέστε δηλώσεις εισαγωγών (import).

// Δηλώστε έναν τύπο με το όνομα user.

// Δημιουργείστε μια συνάρτηση, η οποία αλλάζει την τιμής ενός από τα πεδία του user.
func funcName( /* προσθέστε παράμετρο δείκτη διεύθυνσης, προσθέστε παράμετρο τιμής */ ) {

	// χρησιμοποιήστε τον δείκτη διεύθυνσης, προκειμένου να αλλάξετε την τιμή, στην
	// οποία ο δείκτης, δείχνει.
}

func main() {

	// Δημιουργείστε μια μεταβλητή τύπου user και δώστε αρχική τιμή σε κάθε πεδίο.

	// Παρουσιάστε την τιμή της μεταβλητής.

	// Μοιραστείτε την μεταβλητή με την συνάρτηση, που δηλώσατε παραπάνω.

	// Δηλώστε την τιμή της μεταβλητής.
}
