//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δηλώστε και δώστε αρχική τιμή σε μεταβλητή ακέραιου τύπου, με την τιμή 20.
// Παρουσιάστε την "διεύθυνση της" και την "τιμή της" μεταβλητής.
//
// Δηλώστε και δώστε αρχική τιμή σε μεταβλητή δείκτη διευθύνσεων ακέραιου τύπου, που
// δείχνει προς την τελευταία μεταβλητή, που μόλις δημιουργήσατε. Παρουσιάστε την
// "διεύθυνση της", την "τιμή της" και την "τιμή στην οποία ο δείκτης διεύθυνσης
// δείχνει προς".

package main

// Προσθέστε δηλώσεις εισαγωγής (import).

func main() {

	// Δηλώστε μια μεταβλητή ακεραίου, με τιμή ίση με 20.

	// Παρουσιάστε την "διεύθυνση της" και την "τιμή της" μεταβλητής.

	// Δηλώστε μια μεταβλητή δείκτη διεύθυνσης τύπου int. Εκχωρείστε την
	// διεύθυνση της μεταβλητής ακεραίου, από παραπάνω.

	// Παρουσιάστε την "διεύθυνση της", την "τιμή της" και την "τιμή στην οποία
	// ο δείκτης δείχνει".
}
