//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Υλοποιεί μια συνάρτηση γενικού προγραμματισμού, που μπορεί να σειριοποιήσει
// (στμ. marshal) σε JSON.
package main

// Προσθέστε δηλώσεις εισαγωγής (import).

// Υλοποιήστε την συνάρτηση γενικού προγραμματισμού με το όνομα
// marshal, που μπορεί να δεχθεί κάθε τιμή τύπου T και να σειριοποιήσει
// αυτή την τιμή σε JSON.

// Δηλώστε έναν τύπο struct με το όνομα User με δύο πεδία, το πεδίο Name
// και το πεδίο Age.

func main() {
	// Δημιουργήστε μια τιμή τύπου User.

	// Καλέστε την συνάρτηση γενικού προγραμματισμού marshal.

	// Εκτυπώστε την JSON, που παράγει η συνάρτηση marshal.
}
