//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δείγμα προγράμματος προκειμένου να παρουσιαστεί πως δηλώνεται, λαμβάνει αρχική τιμή
// και γίνεται επαναληπτική προσπέλαση σε ένα πίνακα κατακερματισμού. Παρουσιάζεται επίσης
// πως η επαναληπτική προσπέλαση ενός πίνακα κατακερματισμού είναι τυχαία.
package main

import "fmt"

// Ο user αναπαριστά κάποιον που χρησιμοποιεί το πρόγραμμα.
type user struct {
	name    string
	surname string
}

func main() {

	// Δηλώστε και δώστε αρχικές τιμές στον πίνακα κατακερματισμού.
	users := map[string]user{
		"Roy":     {"Rob", "Roy"},
		"Ford":    {"Henry", "Ford"},
		"Mouse":   {"Mickey", "Mouse"},
		"Jackson": {"Michael", "Jackson"},
	}

	// Προσπελάστε επαναληπτικά τον πίνακα κατακερματισμού τυπώνοντας κάθε κλειδί και τιμή.
	for key, value := range users {
		fmt.Println(key, value)
	}

	fmt.Println()

	// Προσπελάστε επαναληπτικά τον πίνακα κατακερματισμού τυπώνοντας απλά τα κλειδιά.
	// Παρατηρείστε ότι τα αποτελέσματα είναι διαφορετικά.
	for key := range users {
		fmt.Println(key)
	}
}
