//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δηλώστε και δημιουργήστε έναν πίνακα κατακερματισμού ακέραιων τιμών με μια συμβολοσειρά ως κλειδί. Προσθέστε στον
// πίνακα κατακερματισμού πέντε τιμές και επισκεφθείτε διαδοχικά τα στοιχεία του πίνακα κατακερματισμού για να παρουσιάσετε
// τα ζεύγη κλειδιού/τιμής.
package main

// Προσθέστε δηλώσεις εισαγωγής (imports).

func main() {

	// Δηλώστε και δημιουργείστε έναν πίνακα κατακερματισμού με τιμές τύπου ακεραίου.

	// Δώστε μερικές αρχικές τιμές στον πίνακα κατακερματισμού.

	// Παρουσιάστε κάθε ζεύγος κελιδιού/τιμής.
}
