//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δηλώστε και δημιουργήστε έναν σχεσιακό πίνακα ακέραιων τιμών, με μια
// συμβολοσειρά ως κλειδί. Προσθέστε στον σχεσιακό πίνακα πέντε τιμές
// και επισκεφθείτε διαδοχικά τα στοιχεία του σχεσιακού πίνακα, για να
// παρουσιάσετε τα ζεύγη κλειδιού/τιμής.
package main

// Προσθέστε δηλώσεις εισαγωγής (import).

func main() {

	// Δηλώστε και δημιουργείστε έναν σχεσιακό πίνακα, με τιμές τύπου ακεραίου.

	// Δώστε μερικές αρχικές τιμές στον σχεσιακό πίνακα.

	// Παρουσιάστε κάθε ζεύγος κλειδιού/τιμής.
}
