//go:build OMIT

// All material is licensed under the Apache License Version 2.0, January 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δηλώστε ένα πίνακα 5 συμβολοσειρών με κάθε στοιχείο του πίνακα,
// να λαμβάνει σαν αρχική κατάσταση, την κατάσταση μηδενικής τιμής.

// Δηλώστε ένα δεύτερο πίνακα 5 συμβολοσειρών και δώστε αρχικές τιμές
// στα στοιχεία του με ρητές τιμές συμβολοσειράς. Εκχωρείστε τον δεύτερο
// πίνακα στον πρώτο και παρουσιάστε τα αποτελέσματα του πρώτου πίνακα.
//
// Παρουσιάστε την τιμή συμβολοσειράς και την διεύθυνση μνήμης κάθε στοιχείου.
package main

import "fmt"

func main() {

	// Δηλώστε τον πίνακα names προκειμένου να φιλοξενήσει συμβολοσειρές ονομάτων.
	var names [5]string

	// Δηλώστε έναν πίνακα που περιέχει ήδη ονόματα φίλων.
	friends := [5]string{"Joe", "Ed", "Jim", "Erick", "Bill"}

	// Εκχωρείστε τον πίνακα friends στον πίνακα array.
	names = friends

	// Παρουσιάστε κάθε τιμή συμβολοσειράς και τον αντίστοιχο δείκτη διεύθυνσης στον πίνακα names.
	for i, name := range names {
		fmt.Println(name, &names[i])
	}
}
