//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δείγμα προγράμματος, προκειμένου να παρουσιαστεί ο τρόπος δήλωσης και
// επαναληπτικής προσπέλασης πινάκων, διαφορετικών τύπων.
package main

import "fmt"

func main() {

	// Δηλώστε έναν πίνακα πέντε συμβολοσειρών, ο οποίος λαμβάνει ως αρχική τιμή
	// την μηδενική του τιμή.
	var fruits [5]string
	fruits[0] = "Apple"
	fruits[1] = "Orange"
	fruits[2] = "Banana"
	fruits[3] = "Grape"
	fruits[4] = "Plum"

	// Πραγματοποιείστε επαναληπτική προσπέλαση του πίνακα με τις συμβολοσειρές.
	for i, fruit := range fruits {
		fmt.Println(i, fruit)
	}

	// Δηλώστε έναν πίνακα με 4 ακεραίους, που λαμβάνει ως αρχική τιμή
	// κάποιες τιμές.
	numbers := [4]int{10, 20, 30, 40}

	// Πραγματοποιείστε επαναληπτική προσπέλαση του πίνακα με τους αριθμούς.
	for i := 0; i < len(numbers); i++ {
		fmt.Println(i, numbers[i])
	}
}
