//go:build OMIT

// Όλα τα υλικά είναι αδειοδοτημένα υπό την Άδεια Apache Έκδοση 2.0, Ιανουάριος 2004
// http://www.apache.org/licenses/LICENSE-2.0

// Δηλώστε ένα πίνακα 5 συμβολοσειρών με κάθε στοιχείο του πίνακα να λαμβάνει σαν αρχική κατάσταση την κατάσταση
// μηδενικής τιμής.

// Δηλώστε ένα δεύτερο πίνακα 5 συμβολοσειρών και δώστε αρχικές τιμές στα στοιχεία του με ρητές
// τιμές συμβολοσειράς. Εκχωρείστε τον δεύτερο πίνακα στον πρώτο και παρουσιάστε τα αποτελέσματα του πρώτου πίνακα.
// Παρουσιάστε την τιμή συμβολοσειράς και την διεύθυνση μνήμης κάθε στοιχείου.
package main

// Add imports.

func main() {

	// Δηλώστε ένα πίνακα 5 συμβολοσειρών ο οποίος λαμβάνει την μηδενική του τιμή.

	// Δηλώστε ένα πίνακα 5 συμβολοσειρών και δώστε του μια σειρά από ονόματα.

	// Εκχωρείστε τον πίνακα με τα ονόματα στον πίνακα με την μηδενική τιμή.

	// Πραγματοποιείστε επαναλειμμένη προσπέλαση του πρώτου πίνακα.
	// Παρουσιάστε την τιμή συμβολοσειράς και την διεύθυνση του κάθε στοιχείου.
}
